/****************************************************************************
* File: KeyHal.h                                                            *
* Description:                                                              *
*                                            			                    *
* (C)Copyright Sakura corp. 2021		                                    *
*                                                                           *
* Author: GUANU                                                             *
* Created Date: 2021/05/04                                                  *
*                                                                           *
****************************************************************************/
#ifndef KEYHAL_H
#define KEYHAL_H

/****************************************************************************
*                               Include File                                *
****************************************************************************/
#include <r_cg_userdefine.h>
#include <type_define.h>

/****************************************************************************
*                         Public Constant Definition                        *
****************************************************************************/
#define NUMBER_OF_KEYS 2
#define SETKEY 0x00
#define LAMPKEY 0x01

/****************************************************************************
*                              Public Function                              *
****************************************************************************/
/*
@brief 讀Pin值, 按下為1, 無論準位是5亦或是反邏輯的0, 按下就是1
@param Pin腳位位置
@return 1.按下; 0.未按下
*/
TD_UB KeyHal_KeyStateRead(TD_UB aKey);

#endif
